Repository: mbideau/cryptkey-from-usb-mtp
Catalog: locale/*.po
Languages: fr

source: %s failed to mount device '%s'
fr: %s n'a pas réussi à monter le périphérique '%s'

source: '%s' binary not found
fr: binaire '%s' non trouvé

source: (informative only) The disk source to unlock.
fr: (informationnel seulement) Le disque source a dévérouiller.

source: A path to a key file.\n The env var is optional if the argument '%s' is specified, required otherwise.\n Same process apply as for the '%s' argument, i.e.: removing quotes, URL decoding and decrypting.
fr: Un chemin vers un fichier 'clé'.\n La variable d'environnement est optionnelle si l'argument '%s' est spécifié, sinon il est requis.\n Le même processus s'applique que pour l'argument '%s', càd: suppression des guillements, décodage de l'URL, et déchiffrement.

source: AUTHORS
fr: AUTEURS

source: Aborting.
fr: Abandon.

source: Add a mapping entry to a specific mapping file.\n Uses an encrypted key. So when before using the key to decrypt\n the device, it will first ask a password to decrypt the keyfile.
fr: Ajout une entrée de correspondance au fichier de correspondance spécifique.\n Utilise une clé chiffrée. Ainsi, avant d'utiliser la clé pour déchiffrer\n le périphérique, il sera d'abord demander un mot de passe pour déchiffrer le fichier clé.

source: Add a mapping entry to default mapping file.\n It will decrypt the Device Mapper target '%s'\n with the key file searched at '%s'\n on every MTP devices that can be mounted (not filtered out).
fr: Ajoute une entrée de correspondance au fichier de correspondances par défaut.\n Déchiffre le "Device Mapper" cible '%s'\n avec le fichier clé cherché à '%s'\n dans chaque périphérique MTP qui peuvent être montés (pas filtrés).

source: Add a mapping entry to the mapping file (created it if required).\n A mapping entry is an association between a DM target and a key path.
fr: Ajout une entrée de correspondance au fichier de correspondances (créé si besoin).\n Une entrée de correspondance est une association entre un DM cible et un chemin de clé.

source: Arguments are
fr: Les arguments sont

source: Binary '%s' (%s) not found in '%s'
fr: Binaire '%s' (%s) non trouvé dans '%s'

source: Check a mapping file or add a mapping entry.
fr: Vérifie la syntaxe du fichier de correspondances ou ajout une entrée de correspondance.

source: Check a mapping file.\n It is the default behaviour when '%s' is not specified.
fr: Vérifie un fichier de correspondances.\n C'est le comportement par défaut lorsque '%s' est spécifié.

source: Check a specific initramfs
fr: Vérifie un fichier initramfs spécifique

source: Check a specific mapping file
fr: Vérifie un fichier de correspondances spécifique

source: Check current kernel initramfs
fr: Vérifie le fichier initramfs du "kernel" courant

source: Check default mapping file
fr: Vérifie le fichier de correspondances par défaut

source: Check that every requirements had been copied inside the initramfs
fr: Vérifie que tous les fichiers requis ont été copié dans l'initramfs

source: Configuration file '%s' not found in '%s'
fr: Fichier de configuration '%s' non trouvé dans '%s'

source: Copy '%s' required files inside the initramfs
fr: Copie tous les fichiers requis par '%s' dans l'initramfs

source: Create a USB MTP device's filter list based on currently available devices.
fr: Créer une liste de filtrage de périphérique USB MTP basée sur ceux actuellement disponibles.

source: Create a specific filter file
fr: Créer une règle spécifique de filtrage

source: Create default filter file
fr: Créer le fichier de filtrage par défaut

source: Cryptsetup's locale file '%s' not found in '%s'
fr: Fichier de langue pour cryptsetup '%s' non trouvé dans '%s'

source: DM target '%s' already have a mapping
fr: Le DM cible '%s' a déjà une correspondance

source: DM target '%s' do not match any DM target in '%s'
fr: Le DM cible '%s' ne correspond à aucun DM cible dans '%s'

source: DM target is empty for mapping line '%s'
fr: Le DM cible est vide pour la ligne de correspondance '%s'

source: DM target name
fr: Nom du DM cible

source: DM_TARGET
fr: DM_CIBLE

source: Default path to the default configuration file.
fr: Chemin par défaut du fichier de configuration par défaut.

source: Default path to the directory containg tool scripts to help managing configuration.
fr: Chemin par défaut du dossier contenant les utilitaires aidantà gérer la configuration.

source: Default path to the file containing mapping between crypttab DM target and key file.
fr: Chemin par défault du fichier contenant l'association entre les DM cibles et les fichiers 'clés'.

source: Default path to the list of allowed USB MTP devices.
fr: Chemin par défaut de la liste des périphériques USB MTP autorisés.

source: Default path to the list of denied USB MTP devices.
fr: Chemin par défaut de la liste des périphériques USB MTP interdit.

source: Default path to the local configuration file (i.e.: overrides default.conf).
fr: Chemin par défaut du fichier local de configuration (càd: écrase default.conf).

source: Default path to this shell script (to be included in the initramfs).
fr: Chemin par défaut de ce script shell (à inclure dans l'initramfs)

source: Directory '%s' (%s) not found in '%s'
fr: Dossier '%s' (%s) non trouvé dans '%s'

source: Display the version of this script.
fr: Affiche la version de ce script.

source: Display this help.
fr: Afficher cette aide

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: ERROR
fr: ERREUR

source: EXAMPLES
fr: EXEMPLES

source: Enable the debug mode (verbose output to '%s').
fr: Active le mode 'debug' (affichage verbeux sur '%s').

source: Excluding device '%s' (%s)
fr: Exclu le périphérique '%s' (%s)

source: FILES
fr: FICHIERS

source: FILTER_FILE
fr: FICHIER_FILTRE

source: Failed to add device list ot filter file '%s'
fr: Échec de la création du fichier de filtre '%s'

source: Failed to add key '%s' to kernel cache
fr: Échec de l'ajout de la clé '%s' au cache du 'kernel'

source: Failed to create file '%s'
fr: Échec de la création du fichier '%s'

source: Failed to create filter file '%s'
fr: Échec de la création du fichier de filtre '%s'

source: Failed to decrypt key '%s' with cryptsetup
fr: Échec du déchiffrage de la clé '%s' avec 'cryptsetup'

source: Failed to get file size of '%s'
fr: Échec de la récupération de la taille du fichier '%s'

source: Failed to set timeout on cached key '%s'
fr: Échec de la définition d'une limite de temps (timeout) sur la clé mise en cache '%s'

source: Filesystem of device '%s' is not accessible
fr: Le système de fichier du périphérique '%s' n'est pas accessible

source: Filter file '%s' already exists
fr: Le fichier de filtre '%s' existe déjà

source: Force the path to a configuration directory.
fr: Force le chemin du dossier des configurations.

source: Force the path to an include directory.
fr: Force le chemin du dossier des inclusions.

source: Home page
fr: Page d'accueil

source: INITRAMFS_FILE
fr: FICHIER_INITRAMFS

source: If the key path contains non-alphanum char it will be automatically\n encoded with the url format.
fr: Si le chemin du fichier clé contient des caractères non-alphnumériques il sera automatiquement\n encodé au format url.

source: Ignoring device '%s' (filesystem unaccessible)
fr: Ignore le périphérique '%s' (système de fichier inaccessible)

source: Initramfs file '%s' doesn't exist or isn't readable
fr: Le fichier d'initramfs '%s' n'existe pas ou n'est pas lisible

source: Invalid MTP device filter strategy '%s' (must be: %s)
fr: Stratégie de filtrage de périphérique '%s' invalide (doit être: %s)

source: Invalid argument '%s' for option '%s'
fr: Argument '%s' invalide pour l'option '%s'

source: Invalid key options '%s' for mapping line '%s'
fr: Option de clé '%s' invalide pour la ligne de correspondance '%s'

source: Invalid line '%s'
fr: Ligne invalide '%s'

source: Invalid options
fr: Options invalides

source: Is the path to a key file.\n The argument is optional if the env var %s is specified, required otherwise.\n It is relative to the device mount point/dir.\n Quotes ['"] will be removed at the begining and end.\n If it starts with '%s' it will be URL decoded.\n If it starts with '%s' it will be decrypted with '%s' on the file.\n '%s' and '%s' can be combined in any order, i.e.: '%s' or '%s'.
fr: Est le chemin vers un fichier clé.\n L'argument est optionnel si la variable d'environnement %s est spécifiée, sinon il est requis.\n Il est relatif au point de montage du périphérique.\n Les guillements ['"] seront supprimés au début et à la fin.\n S'il débute par '%s' il sera décodé depuis un format URL.\n S'il débute par '%s' le fichier sera déchiffré avec '%s'.\n '%s' et '%s' peuvent être combiné dans n'importe quel ordre, càd: '%s' ou '%s'.

source: KEYFILE_REL_PATH
fr: CHEMIN_REL_FICH_CLE

source: Kernel module '%s' (%s) not found in '%s'
fr: Module 'kernel' '%s' (%s) non trouvé dans '%s'

source: Key caching is disabled
fr: La mise en cache des clé est désactivée

source: Key content size '%s' exceeds cache max size of '%s'
fr: La taille '%s' du contenu de la clé dépasse la taille maximale du cache '%s'

source: Key decrypted but device mapper '%s' doesn't exists! Bug?
fr: Clé déchiffrée mais le 'device mapper' '%s' n'existe pas! Bug?

source: Key path is empty for mapping line '%s'
fr: Le chemin de la clé est vide pour la ligne de correspondance '%s'

source: Keyfile path relative to device filesystem
fr: Chemin du fichier clé relatif au système de fichier du périphérique

source: Library '%s' (%s) not found in '%s'
fr: Librairie '%s' (%s) non trouvée dans '%s'

source: License %s: %s <%s>
fr: Licence %s: %s <%s>

source: Locale archive file '%s' not found in '%s'
fr: Fichier archive de langues '%s' non trouvé dans '%s'

source: Locale file '%s' not found in '%s'
fr: Fichier de langue '%s' non trouvé dans '%s'

source: MAPPING_FILE
fr: FICHIER_CORRESPONDANCES

source: MTP device list file '%s' doesn't exist nor is readable
fr: Le fichier de la liste des périphériques MTP '%s' n'existe pas ou est illisible

source: Mapping file '%s' doesn't exist or isn't readable
fr: Le fichier de correspondances '%s' n'existe pas ou est illisible

source: NAME
fr: NOM

source: No MTP device available (after %ss timeout)
fr: Aucun périphérique MTP disponible (après %ss d'attente)

source: Note: Paths may have changed, at installation time, by configuration or environment.
fr: Note: Les chemins peuvent avoir changés, à l'installation, par configuration ou environnement.

source: OK. Initramfs '%s' seems to contain every thing required.
fr: OK. L'initramfs '%s' semble contenir tous les fichiers requis.

source: On Debian you can install it with: > %s
fr: Sur Debian vous pouvez l'installer avec: > %s

source: Override the mapping for DM target '%s' [Y/n] ?
fr: Remplacer la correspondance du DM cible '%s' [O/n] ?

source: Path to initramfs hook that inject required files into initramfs.
fr: Chemin du 'hook' initramfs qui injecte les fichiers requis dans l'initramfs.

source: Please manually enter the passphrase to unlock disk '%s'
fr: S'il vous plait, saisissez manuellement la phrase secrète pour dévérouiller le disque '%s'

source: Please unlock the device '%s', then hit enter ... ('s' to skip)
fr: S'il vous plait, dévérouillez le périphérique '%s', puis appuyez sur 'entrée' ... ('s' pour passer)

source: Print a key to STDOUT from a key file stored on a USB MTP device.
fr: Affiche une clé dans STDOUT issue d'un fichier clé stocké sur un périphérique USB MTP.

source: Print dependencies
fr: Affiche les dépendances

source: REPORTING BUGS
fr: SIGNALER DES BUGS

source: Removing key '%s' from cache
fr: Suppression de la mise en cache de la clé '%s'

source: Report bugs to
fr: Signaler les bugs à

source: SEE ALSO
fr: VOIR AUSSI

source: SYNOPSIS
fr: RÉSUMÉ

source: Shell include script '%s' not found in '%s'
fr: Script shell d'inclusion '%s' non trouvé dans '%s'

source: Shell script '%s' not found in '%s'
fr: Script shell '%s' non trouvé dans '%s'

source: Skipping unlocking device '%s'
fr: Passe le dévérouillage du périphérique '%s'

source: The content for key '%s' cannot be cached
fr: Le contenu de la clé '%s' ne peut pas être mis en cache

source: The key is encrypted (and will need decryption)
fr: La clé est chiffrée (et aura besoin d'être déchiffrée)

source: The path to an initramfs file (i.e.: %s)\n Default to: '%s'
fr: Le chemin d'un fichier initramfs (càd: %s)\n Par défaut vaut: '%s'

source: The path to the created filter file.\n It default to the configuration value of %s which in turn depends on the value of %s.\n Currently it is: '%s'.
fr: Le chemin du fichier de filtrage créé.\n Par défaut prend la valeur configurée %s qui elle-même dépend de la valeur de %s.\n Actuellement vaut: '%s'.

source: The path to the mapping file.\n It default to: '%s'.
fr: Chemin du fichier de correspondances.\n Par défaut vaut: '%s'.

source: The target device mapper name (unlocked).\n It is used to do the mapping with a key if none is specified in the crypttab file, else informative only.
fr: Nom du 'device mapper' cible (dévérouillé).\n Est utilisé pour faire la correspondance avec une clé si aucune n'est spécifiée dans le fichier 'crypttab', sinon est uniquement informatif.

source: There is NO WARRANTY, to the extent permitted by law.
fr: Il n'y AUCUNE GARANTIE, jusqu'à ce que permet la loi.

source: This is free software: you are free to change and redistribute it.
fr: Ceci est un logiciel libre: vous êtes libre de le modifier et de le redistribuer.

source: To further investigate, you can use this command to list files inside initramfs:\n> %s
fr: Pour investiguer plus, vous pouvez utiliser cette commande pour lister les fichiers dans l'initramfs:\n> %s

source: Too few arguments for option '%s'
fr: Trop peu d'arguments pour l'option '%s'

source: Uh, I do not understand the cause of failure (bug?), sorry
fr: Euh, je ne comprends pas la cause de l'échec (bug?), désolé

source: Unlocking '%s' with cached key '%s' ...
fr: Dévérouille '%s' avec la clé mise en cache '%s' ...

source: Unlocking '%s' with%s key file '%s' ...
fr: Dévérouille '%s' avec le fichier clé%s '%s' ...

source: Unlocking '%s' with%s key file ...
fr: Dévérouille '%s' avec le fichier clé%s ...

source: Use this domain directory to do the translation (i.e.: %s).
fr: Utiliser ce dossier domaine pour effectuer la traduction (ex: %s).

source: Use this language to do the translation (i.e.: %s).
fr: Utiliser cette langue pour effectuer la traduction (ex: %s).

source: Use this locale to do the translation (i.e.: %s).
fr: Utiliser cette 'locale' pour effectuer la traduction (ex: %s).

source: Use this script as a standalone shell command to unlock a disk
fr: Utilise ce script en tant que commande shell 'standalone' pour dévérouiller un disque

source: Value '%s' cannot contain mapping file separator '%s'
fr: La value '%s' ne peut contenir le charactère '%s' de séparation du fichier de correspondances

source: WARNING
fr: AVERTISSEMENT

source: Waiting for an MTP device to become available (max %ss) ...
fr: Attente qu'un périphérique MTP devienne disponible (max %ss) ...

source: Written by
fr: Écrit par

source: backup
fr: de secours

source: keyfile
fr: fichier_cle

source: optional
fr: optionnel
